[
  {
    "id": "T1608",
    "description": [
      [
        {
          "type": "text",
          "content": "Adversaries may upload, install, or otherwise set up capabilities that can be used during targeting. To support their operations, an adversary may need to take capabilities they developed (Develop Capabilities) or obtained (Obtain Capabilities) and stage them on infrastructure under their control. These capabilities may be staged on infrastructure that was previously purchased/rented by the adversary (Acquire Infrastructure) or was otherwise compromised by them (Compromise Infrastructure). Capabilities may also be staged on web services, such as GitHub or Pastebin, or on Platform-as-a-Service (PaaS) offerings that enable users to easily provision applications."
        }
      ],
      [
        {
          "type": "text",
          "content": "Staging of capabilities can aid the adversary in a number of initial access and post-compromise behaviors, including (but not limited to):"
        }
      ],
      [
        {
          "type": "li",
          "content": "Staging web resources necessary to conduct Drive-by Compromise when a user browses to a site."
        },
        {
          "type": "li",
          "content": "Staging web resources for a link target to be used with spearphishing."
        },
        {
          "type": "li",
          "content": "Uploading malware or tools to a location accessible to a victim network to enable Ingress Tool Transfer."
        },
        {
          "type": "li",
          "content": "Installing a previously acquired SSL/TLS certificate to use to encrypt command and control traffic (ex: Asymmetric Cryptography with Web Protocols)."
        }
      ]
    ],
    "mitigations": [
      {
        "id": "M1056",
        "name": "Pre-compromise",
        "description": [
          [
            {
              "type": "text",
              "content": "This technique cannot be easily mitigated with preventive controls since it is based on behaviors performed outside of the scope of enterprise defenses and controls."
            }
          ]
        ]
      }
    ]
  }
]
